tap "alecthomas/tap"
tap "caryll/tap"
tap "go-task/tap"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "homebrew/services"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Friendly powerful distributed version control system
brew "bazaar"
# Cross-platform make
brew "cmake"
# Dependency manager for Cocoa projects
brew "cocoapods"
# Good-lookin' diffs with diff-highlight and more
brew "diff-so-fancy"
# Modern replacement for 'ls'
brew "exa"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Command-line fuzzy finder written in Go
brew "fzf"
# Remote repository management made easy
brew "ghq"
# Alternative to top/htop
brew "glances"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# User-friendly cURL replacement (command-line HTTP client)
brew "httpie"
# Creates dependencies in makefiles
brew "makedepend"
# NCurses Disk Usage
brew "ncdu"
# Platform built on V8 to build network applications
brew "node"
# Object-relational database system
brew "postgresql", restart_service: true
# Wrapper to colorize and simplify ping's output
brew "prettyping"
# Protocol buffers (Google's data interchange format)
brew "protobuf"
# Persistent key-value database, with built-in net interface
brew "redis", restart_service: true
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# The Rust toolchain installer
brew "rustup-init"
# Generate scripting interfaces to C/C++ code
brew "swig"
# User interface to the TELNET protocol (built from macOS Sierra sources)
brew "telnet"
# UNIX shell (command interpreter)
brew "zsh"
# Concurrently run Go lint tools and normalise their output.
brew "alecthomas/tap/gometalinter"
# Task runner / simpler Make alternative written in Go
brew "go-task/tap/go-task"
cask "fastlane"
cask "font-iosevka"
cask "jetbrains-toolbox"
cask "ngrok"
cask "spotify"
