tap "caryll/tap"
tap "go-task/tap"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "homebrew/services"
# Friendly powerful distributed version control system
brew "bazaar"
# Modern replacement for 'ls'
brew "exa"
# Fast, simple fuzzy text selector with an advanced scoring algorithm
brew "fzy"
# Remote repository management made easy
brew "ghq"
# User-friendly cURL replacement (command-line HTTP client)
brew "httpie"
# Platform built on V8 to build network applications
brew "node"
# Object-relational database system
brew "postgresql", restart_service: true
# Protocol buffers (Google's data interchange format)
brew "protobuf"
# Persistent key-value database, with built-in net interface
brew "redis", restart_service: true
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# The Rust toolchain installer
brew "rustup-init"
# Generate scripting interfaces to C/C++ code
brew "swig"
# UNIX shell (command interpreter)
brew "zsh"
# Task runner / simpler Make alternative written in Go
brew "go-task/tap/go-task"
cask "font-iosevka"
cask "jetbrains-toolbox"
cask "ngrok"
