tap "alecthomas/tap"
tap "caryll/tap"
tap "filosottile/musl-cross"
tap "go-task/tap"
tap "golangci/tap"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "homebrew/services"
tap "mscharley/homebrew"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Friendly powerful distributed version control system
brew "bazaar"
# Size profiler for binaries
brew "bloaty"
# Cross-platform make
brew "cmake"
# Dependency manager for Cocoa projects
brew "cocoapods"
# Good-lookin' diffs with diff-highlight and more
brew "diff-so-fancy"
# Modern replacement for 'ls'
brew "exa"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Command-line fuzzy finder written in Go
brew "fzf"
# Remote repository management made easy
brew "ghq"
# Git extension for versioning large files
brew "git-lfs"
# Alternative to top/htop
brew "glances"
# Command-driven, interactive function plotting
brew "gnuplot"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Database migrations CLI tool
brew "golang-migrate"
# User-friendly cURL replacement (command-line HTTP client)
brew "httpie"
# Command-line benchmarking tool
brew "hyperfine"
# USB multiplexor daemon for iPhone and iPod Touch devices
brew "usbmuxd", args: ["HEAD"]
# Library to communicate with iOS devices natively
brew "libimobiledevice", args: ["HEAD"]
# Cross-platform library for communicating with iOS devices
brew "ideviceinstaller"
# Install and debug iPhone apps from the command-line
brew "ios-deploy"
# Lightweight and flexible command-line JSON processor
brew "jq"
# The Kubernetes package manager
brew "kubernetes-helm"
# Creates dependencies in makefiles
brew "makedepend"
# Platform built on V8 to build network applications
brew "node"
# Object-relational database system
brew "postgresql", restart_service: true
# Wrapper to colorize and simplify ping's output
brew "prettyping"
# Protocol buffers (Google's data interchange format)
brew "protobuf"
# Persistent key-value database, with built-in net interface
brew "redis", restart_service: true
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# The Rust toolchain installer
brew "rustup-init"
# Generate scripting interfaces to C/C++ code
brew "swig"
# User interface to the TELNET protocol (built from macOS Sierra sources)
brew "telnet"
# Auto-hinter for TrueType fonts
brew "ttfautohint"
# UNIX shell (command interpreter)
brew "zsh"
# Additional completion definitions for zsh
brew "zsh-completions"
# Concurrently run Go lint tools and normalise their output.
brew "alecthomas/tap/gometalinter"
# Parses & writes SFNT structures.
brew "caryll/tap/otfcc-mac64"
# Linux cross compilers based on musl libc
brew "filosottile/musl-cross/musl-cross"
# Task runner / simpler Make alternative written in Go
brew "go-task/tap/go-task"
# Fast linters runner for Go.
brew "golangci/tap/golangci-lint"
cask "font-ibm-plex"
cask "font-input"
cask "font-iosevka"
cask "google-cloud-sdk"
cask "ngrok"
